app/controllers/links_controller.rb

  def create
    @link = current_user.links.build(link_params)

    respond_to do |format|
      if @link.save
---
INSERT INTO "links" ("title", "url", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "CSS Tricks"], ["url", "www.csstricks.com"], ["created_at", 2016-12-03 20:36:41 UTC], ["updated_at", 2016-12-03 20:36:41 UTC], ["user_id", 1]]

  def update
    respond_to do |format|
      if @link.update(link_params)
---
UPDATE "links" SET "url" = ?, "updated_at" = ? WHERE "links"."id" = ?  [["url", "html://www.csstricks.com"], ["updated_at", 2016-12-04 00:15:40 UTC], ["id", 4]]